class Messages:
    ADDED_TO_QUEUE = (
        "𝚈𝚘𝚞𝚛 𝚛𝚎𝚚𝚞𝚎𝚜𝚝 𝚑𝚊𝚜 𝚋𝚎𝚎𝚗 𝚊𝚍𝚍𝚎𝚍 𝚝𝚘 𝚝𝚑𝚎 𝚚𝚞𝚎𝚞𝚎. 𝙸𝚏 𝚢𝚘𝚞 𝚑𝚊𝚟𝚎 𝚖𝚘𝚛𝚎 𝚝𝚑𝚊𝚗 {per_user_process_count} "
        "𝚘𝚗𝚐𝚘𝚒𝚗𝚐 𝚙𝚛𝚘𝚌𝚎𝚜𝚜𝚎𝚜, 𝚝𝚑𝚎𝚗 𝚝𝚑𝚒𝚜 𝚙𝚛𝚘𝚌𝚎𝚜𝚜 𝚠𝚒𝚕𝚕 𝚘𝚗𝚕𝚢 𝚜𝚝𝚊𝚛𝚝 𝚊𝚏𝚝𝚎𝚛 𝚘𝚗𝚎 𝚘𝚏 𝚝𝚑𝚎𝚖 𝚏𝚒𝚗𝚒𝚜𝚑𝚎𝚜."
    )
    MEDIA_MESSAGE_DELETED = "𝚆𝚑𝚢 𝚍𝚒𝚍 𝚢𝚘𝚞 𝚍𝚎𝚕𝚎𝚝𝚎 𝚝𝚑𝚎 𝚏𝚒𝚕𝚎 😡, 𝙽𝚘𝚠 𝚒 𝚌𝚊𝚗𝚗𝚘𝚝 𝚑𝚎𝚕𝚙 𝚢𝚘𝚞 🤔."
    CANNOT_OPEN_FILE = "😢 𝖲𝗈𝗋𝗋𝗒! 𝖨 𝖼𝖺𝗇𝗇𝗈𝗍 𝗈𝗉𝖾𝗇 𝗍𝗁𝖾 𝖿𝗂𝗅𝖾."
    PROCESS_TIMEOUT = (
        "😢 𝚂𝚘𝚛𝚛𝚢! 𝚙𝚛𝚘𝚌𝚎𝚜𝚜 𝚏𝚊𝚒𝚕𝚎𝚍 𝚍𝚞𝚎 𝚝𝚘 𝚝𝚒𝚖𝚎𝚘𝚞𝚝. 𝚈𝚘𝚞𝚛 𝚙𝚛𝚘𝚌𝚎𝚜𝚜 𝚠𝚊𝚜 "
        "𝚝𝚊𝚔𝚒𝚗𝚐 𝚝𝚘𝚘 𝚕𝚘𝚗𝚐 𝚝𝚘 𝚌𝚘𝚖𝚙𝚕𝚎𝚝𝚎, 𝚑𝚎𝚗𝚌𝚎 𝚌𝚊𝚗𝚌𝚎𝚕𝚕𝚎𝚍."
    )
    TRACK_USER_ACTIVITY = "User id: `{chat_id}`"
    PROCESSING_REQUEST = "𝙿𝚛𝚘𝚌𝚎𝚜𝚜𝚒𝚗𝚐 𝚢𝚘𝚞𝚛 𝚛𝚎𝚚𝚞𝚎𝚜𝚝, 𝙿𝚕𝚎𝚊𝚜𝚎 𝚠𝚊𝚒𝚝! 🥱"
    SCREENSHOT_AT = "ScreenShot at {time}"
    SCREENSHOT_PROCESS_FAILED = "😢 𝚂𝚘𝚛𝚛𝚢! 𝚂𝚌𝚛𝚎𝚎𝚗𝚜𝚑𝚘𝚝 𝚐𝚎𝚗𝚎𝚛𝚊𝚝𝚒𝚘𝚗 𝚏𝚊𝚒𝚕𝚎𝚍 𝚙𝚘𝚜𝚜𝚒𝚋𝚕𝚢 𝚍𝚞𝚎 𝚝𝚘 𝚜𝚘𝚖𝚎 𝚒𝚗𝚏𝚛𝚊𝚜𝚝𝚛𝚞𝚌𝚝𝚞𝚛𝚎 𝚏𝚊𝚒𝚕𝚞𝚛𝚎 😢."
    SCREENSHOT_PROCESS_SUCCESS = (
        "🤷 𝕐𝕠𝕦 𝕣𝕖𝕢𝕦𝕖𝕤𝕥𝕖𝕕 {count} 𝕤𝕔𝕣𝕖𝕖𝕟𝕤𝕙𝕠𝕥𝕤 𝕒𝕟𝕕 "
        "{total_count} 𝕤𝕔𝕣𝕖𝕖𝕟𝕤𝕙𝕠𝕥𝕤 𝕘𝕖𝕟𝕖𝕣𝕒𝕥𝕖𝕕, "
        "ℕ𝕠𝕨 𝕤𝕥𝕒𝕣𝕥𝕚𝕟𝕘 𝕥𝕠 𝕦𝕡𝕝𝕠𝕒𝕕!"
    )
    PROCESS_UPLOAD_CONFIRM = (
        "𝙎𝙪𝙘𝙘𝙚𝙨𝙨𝙛𝙪𝙡𝙡𝙮 𝙘𝙤𝙢𝙥𝙡𝙚𝙩𝙚𝙙 𝙥𝙧𝙤𝙘𝙚𝙨𝙨 𝙞𝙣 {total_process_duration}\n\n"
        "𝙃𝙤𝙬 𝙞𝙨 𝙩𝙝𝙞𝙨 𝙗𝙤𝙩..🤔🥴 [𝘾𝙡𝙞𝙘𝙠 𝙝𝙚𝙧𝙚.](tg://resolve?domain=MD_BOTZ&post=21)."
    )
    WRONG_FORMAT = "𝙿𝚕𝚎𝚊𝚜𝚎 𝚏𝚘𝚕𝚕𝚘𝚠 𝚝𝚑𝚎 𝚜𝚙𝚎𝚌𝚒𝚏𝚒𝚎𝚍 𝚏𝚘𝚛𝚖𝚊𝚝"
    VIDEO_PROCESS_CAPTION = "𝚂𝚊𝚖𝚙𝚕𝚎 𝚟𝚒𝚍𝚎𝚘. {duration}𝚜 𝚏𝚛𝚘𝚖 {start}"
    SCREENSHOTS_START = "👌 𝙶𝚎𝚗𝚎𝚛𝚊𝚝𝚒𝚗𝚐 𝚜𝚌𝚛𝚎𝚎𝚗𝚜𝚑𝚘𝚝𝚜!."

    SAMPLE_VIDEO_PROCESS_START = "🥱 𝐆𝐞𝐧𝐞𝐫𝐚𝐭𝐢𝐧𝐠 𝐒𝐚𝐦𝐩𝐥𝐞 𝐕𝐢𝐝𝐞𝐨! 𝐓𝐡𝐢𝐬 𝐦𝐢𝐠𝐡𝐭 𝐭𝐚𝐤𝐞 𝐬𝐨𝐦𝐞 𝐭𝐢𝐦𝐞."
    SAMPLE_VIDEO_PROCESS_FAILED = "😢 𝚂𝚘𝚛𝚛𝚢! 𝚂𝚊𝚖𝚙𝚕𝚎 𝚟𝚒𝚍𝚎𝚘 𝚐𝚎𝚗𝚎𝚛𝚊𝚝𝚒𝚘𝚗 𝚏𝚊𝚒𝚕𝚎𝚍 𝚙𝚘𝚜𝚜𝚒𝚋𝚕𝚢 𝚍𝚞𝚎 𝚝𝚘 𝚜𝚘𝚖𝚎 𝚒𝚗𝚏𝚛𝚊𝚜𝚝𝚛𝚞𝚌𝚝𝚞𝚛𝚎 𝚏𝚊𝚒𝚕𝚞𝚛𝚎 😥."
    SAMPLE_VIDEO_PROCESS_SUCCESS = (
        "🤷 𝚂𝚊𝚖𝚙𝚕𝚎 𝚟𝚒𝚍𝚎𝚘 𝚠𝚊𝚜 𝚐𝚎𝚗𝚎𝚛𝚊𝚝𝚎𝚍 𝚜𝚞𝚌𝚌𝚎𝚜𝚜𝚏𝚞𝚕𝚕𝚢!, 𝙽𝚘𝚠 𝚜𝚝𝚊𝚛𝚝𝚒𝚗𝚐 𝚝𝚘 𝚞𝚙𝚕𝚘𝚊𝚍!"
    )
    SAMPLE_VIDEO_PROCESS_FAILED_GENERATION = (
        "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n 𝘥𝘶𝘳𝘢𝘵𝘪𝘰𝘯 {sample_duration} 𝘴𝘢𝘮𝘱𝘭𝘦 𝘷𝘪𝘥𝘦𝘰 "
        "𝘨𝘦𝘯𝘦𝘳𝘢𝘵𝘪𝘰𝘯 𝘧𝘢𝘪𝘭𝘦𝘥\n\n{ffmpeg_output}"
    )
    SAMPLE_VIDEO_PROCESS_OPEN_ERROR = (
        "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘚𝘢𝘮𝘱𝘭𝘦 𝘷𝘪𝘥𝘦𝘰 𝘳𝘦𝘲𝘶𝘦𝘴𝘵𝘦𝘥\n\n{duration}"
    )

    SCREENSHOTS_PROGRESS = "🤣 `{current}` 𝒐𝒇 `{total}` 𝒈𝒆𝒏𝒆𝒓𝒂𝒕𝒆𝒅!"
    MANUAL_SCREENSHOTS_OPEN_ERROR = (
        "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘙𝘦𝘲𝘶𝘦𝘴𝘵𝘦𝘥 𝘮𝘢𝘯𝘶𝘢𝘭 𝘴𝘤𝘳𝘦𝘦𝘯𝘴𝘩𝘰𝘵𝘴\n\n{duration}"
    )
    MANUAL_SCREENSHOTS_NO_VALID_POSITIONS = (
        "😢 𝚂𝚘𝚛𝚛𝚢! 𝙽𝚘𝚗𝚎 𝚘𝚏 𝚝𝚑𝚎 𝚐𝚒𝚟𝚎𝚗 𝚙𝚘𝚜𝚒𝚝𝚒𝚘𝚗𝚜 𝚠𝚑𝚎𝚛𝚎 𝚟𝚊𝚕𝚒𝚍!"
    )
    MANUAL_SCREENSHOTS_VALID_PISITIONS_ABOVE_LIMIT = (
        "😢 𝚂𝚘𝚛𝚛𝚢! 𝙾𝚗𝚕𝚢 20 𝚜𝚌𝚛𝚎𝚎𝚗𝚜𝚑𝚘𝚝𝚜 𝚌𝚊𝚗 𝚋𝚎 𝚐𝚎𝚗𝚎𝚛𝚊𝚝𝚎𝚍. 𝙵𝚘𝚞𝚗𝚍 {valid_positions_count} "
        "𝚟𝚊𝚕𝚒𝚍 𝚙𝚘𝚜𝚒𝚝𝚒𝚘𝚗𝚜 𝚒𝚗 𝚢𝚘𝚞𝚛 𝚛𝚎𝚚𝚞𝚎𝚜𝚝"
    )
    MANUAL_SCREENSHOTS_INVALID_POSITIONS_ALERT = (
        "𝙵𝚘𝚞𝚗𝚍 {invalid_positions_count} 𝚒𝚗𝚟𝚊𝚕𝚒𝚍 𝚙𝚘𝚜𝚒𝚝𝚒𝚘𝚗𝚜 ({invalid_positions}).\n\n"
        "💚💚 𝙶𝚎𝚗𝚎𝚛𝚊𝚝𝚒𝚗𝚐 𝚜𝚌𝚛𝚎𝚎𝚗𝚜𝚑𝚘𝚝𝚜 𝚊𝚏𝚝𝚎𝚛 𝚒𝚐𝚗𝚘𝚛𝚒𝚗𝚐 𝚝𝚑𝚎𝚜𝚎!."
    )
    MANUAL_SCREENSHOTS_FAILED_GENERATION = (
        "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘮𝘢𝘯𝘶𝘢𝘭 𝘴𝘤𝘳𝘦𝘦𝘯𝘴𝘩𝘰𝘵𝘴 {raw_user_input}."
    )

    TRIM_VIDEO_INVALID_RANGE = "𝚃𝚑𝚎 𝚛𝚊𝚗𝚐𝚎 𝚢𝚘𝚞 𝚙𝚛𝚘𝚟𝚒𝚍𝚎𝚍 𝚒𝚜 𝚒𝚗𝚟𝚊𝚕𝚒𝚍!"
    TRIM_VIDEO_DURATION_ERROR = (
        "𝙿𝚕𝚎𝚊𝚜𝚎 𝚙𝚛𝚘𝚟𝚒𝚍𝚎 𝚊𝚗𝚢 𝚛𝚊𝚗𝚐𝚎 𝚝𝚑𝚊𝚝'𝚜 𝚞𝚙𝚝𝚘 {max_duration}𝚜."
        "𝚈𝚘𝚞𝚛 𝚛𝚎𝚚𝚞𝚎𝚜𝚝𝚎𝚍 𝚛𝚊𝚗𝚐𝚎 **{start}:{end}** 𝚒𝚜 `{request_duration}𝚜 𝚕𝚘𝚗𝚐!"
    )
    TRIM_VIDEO_OPEN_ERROR = "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘵𝘳𝘪𝘮 𝘷𝘪𝘥𝘦𝘰 𝘳𝘦𝘲𝘶𝘦𝘴𝘵𝘦𝘥\n\n{start}:{end}\n\n{duration}"
    TRIM_VIDEO_RANGE_OUT_OF_VIDEO_DURATION = (
        "😢 𝚂𝚘𝚛𝚛𝚢! 𝚃𝚑𝚎 𝚛𝚎𝚚𝚞𝚎𝚜𝚝𝚎𝚍 𝚛𝚊𝚗𝚐𝚎 𝚒𝚜 𝚘𝚞𝚝 𝚘𝚏 𝚝𝚑𝚎 𝚟𝚒𝚍𝚎𝚘'𝚜 𝚍𝚞𝚛𝚊𝚝𝚒𝚘𝚗!."
    )
    TRIM_VIDEO_PROCESS_FAILED = (
        "😿 𝚂𝚘𝚛𝚛𝚢! 𝚟𝚒𝚍𝚎𝚘 𝚝𝚛𝚒𝚖𝚖𝚒𝚗𝚐 𝚏𝚊𝚒𝚕𝚎𝚍 𝚙𝚘𝚜𝚜𝚒𝚋𝚕𝚢 𝚍𝚞𝚎 𝚝𝚘 𝚜𝚘𝚖𝚎 𝚒𝚗𝚏𝚛𝚊𝚜𝚝𝚛𝚞𝚌𝚝𝚞𝚛𝚎 𝚏𝚊𝚒𝚕𝚞𝚛𝚎 😢."
    )
    TRIM_VIDEO_PROCESS_FAILED_GENERATION = "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘝𝘪𝘥𝘦𝘰 𝘵𝘳𝘪𝘮 𝘧𝘢𝘪𝘭𝘦𝘥.\n\n{start}:{end}\n\n{ffmpeg_output}"
    TRIM_VIDEO_PROCESS_SUCCESS = (
        "🤷 𝚅𝚒𝚍𝚎𝚘 𝚝𝚛𝚒𝚖𝚖𝚎𝚍 𝚜𝚞𝚌𝚌𝚎𝚜𝚜𝚏𝚞𝚕𝚕𝚢!, 𝙽𝚘𝚠 𝚜𝚝𝚊𝚛𝚝𝚒𝚗𝚐 𝚝𝚘 𝚞𝚙𝚕𝚘𝚊𝚍!"
    )
    TRIM_VIDEO_START = "🥱 𝚃𝚛𝚒𝚖𝚖𝚒𝚗𝚐 𝚈𝚘𝚞𝚛 𝚅𝚒𝚍𝚎𝚘! 𝚃𝚑𝚒𝚜 𝚖𝚒𝚐𝚑𝚝 𝚝𝚊𝚔𝚎 𝚜𝚘𝚖𝚎 𝚝𝚒𝚖𝚎."

    SCREENSHOTS_OPEN_ERROR = "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n𝘙𝘦𝘲𝘶𝘦𝘴𝘵𝘦𝘥 𝘴𝘤𝘳𝘦𝘦𝘯𝘴𝘩𝘰𝘵𝘴: {num_screenshots}.\n\n{duration}"
    SCREENSHOTS_FAILED_GENERATION = (
        "𝘴𝘵𝘳𝘦𝘢𝘮 𝘭𝘪𝘯𝘬 : {file_link}\n\n{num_screenshots} 𝘴𝘤𝘳𝘦𝘦𝘯𝘴𝘩𝘰𝘵𝘴 𝘸𝘩𝘦𝘳𝘦 𝘳𝘦𝘲𝘶𝘦𝘴𝘵𝘦𝘥 "
        "𝘢𝘯𝘥 𝘚𝘤𝘳𝘦𝘦𝘯 𝘴𝘩𝘰𝘵𝘴 𝘸𝘩𝘦𝘳𝘦 𝘯𝘰𝘵 𝘨𝘦𝘯𝘦𝘳𝘢𝘵𝘦𝘥."
    )

    MEDIAINFO_START = "𝙵𝚒𝚗𝚍𝚒𝚗𝚐 𝚝𝚑𝚎 𝚖𝚎𝚍𝚒𝚊 𝚒𝚗𝚏𝚘, 𝚖𝚎𝚍𝚒𝚊 𝚒𝚗𝚏𝚘 𝚠𝚒𝚕𝚕 𝚋𝚎 𝚜𝚎𝚗𝚍 𝚑𝚎𝚛𝚎 𝚜𝚑𝚘𝚛𝚝𝚕𝚢!"
